Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_DevelopiOSAppsSwift/DevelopiOSAppsSwift-level2.tmx
Source language: en_us
Languages: ja

source: The controls fit in the normal allotted space, but the control doesn’t adapt when the space is reduced.
ja: コントロールは通常に割り当てられた空間にぴったり合います、しかしコントロールは空間が減らされる時に適応しません。

source: The dashes indicate that the control is currently using the default values (in this case 44.0 points and 5 stars).
ja: ダッシュは、コントロールが現在は省略時の値を使っていることを示します（この場合44.0ポイントと5スター）。

source: The default image displays in the image view.
ja: 初期画像がイメージビューに表示されます。

source: The delegate can use this information to save or clear data at the right time, dismiss the keyboard, and so on.
ja: 委任先は、この情報を使ってデータを保存したり消去したりがちょうど良いとき、キーボードを片付けたときなどに行えます。

source: The delegate may respond by for example, updating the appearance or state of itself or of other objects in the app, or returning a value that affects how an impending event is handled.
ja: 委任先は、例えば、それ自身やアプリ中の他のオブジェクトの外観や状態を更新すること、またはすぐに起ころうとしているイベントが取り扱われる方法に影響を及ぼす値を返すことでで応答するかもしれません。

source: The delegating object—in this case, the text field—keeps a reference to the other object—the delegate—and at the appropriate time, the delegating object sends a message to the delegate.
ja: 委任しているオブジェクト—この場合、テキスト欄—は、他のオブジェクト—委任先—への参照を保有します、そして適切なときに、委任しているオブジェクトはメッセージを委任先に送ります。

source: The detail scene should be prepopulated with data about the meal.
ja: 詳細シーンは、その食事についてのデータであらかじめ満たされるはずです。

source: The editor window shows the results of the currently open file.
ja: エディタウインドウは、現在開くファイルの結果を示します。

source: The elements in the stack view center horizontally:
ja: スタックビューの中の要素は横方向の真ん中に置かれます。

source: The elements that appear in the user interface are known as views.
ja: ユーザインターフェイスの中に現れる要素は、ビューとして知られます。

source: The else case prints an error message to the console and terminates the app.
ja: このelseの状況は、エラーメッセージをコンソールに出力してアプリを終了します。

source: The event is the user tapping the Set Default Text button.
ja: イベント（出来事）は、ユーザがSet Default Textボタンをタップすることです。

source: The expectation is that the unwrapping and casting operations will never fail.
ja: 期待されることは、アンラップおよびキャスト操作が決して失敗しないことになります。

source: The final step to displaying data in the user interface is to connect the code defined in MealTableViewController.swift to the meal list scene.
ja: ユーザインターフェイスにおいてデータを表示するための最後の段階は、MealTableViewController.swiftにおいて定義されたコードを食事リストシーンに接続することになります。

source: The first scene that’s shown from a storyboard when an app starts.
ja: 最初のシーン、それは、アプリがスタートする時にストーリーボードから見せられるものです。

source: The first is a property that contains the list of buttons.
ja: 最初のものは、ボタンのリストを含むプロパティです。

source: The first item added to a the navigation stack of a navigation controller.
ja: ナビゲーションコントローラのナビゲーションスタックに加えられた最初の項目。

source: The first item added to the stack becomes the root view controller and is never popped off (removed from) the navigation stack.
ja: そのスタックに追加される最初の項目は、ルートビューコントローラになります、そして決してそのナビゲーションスタックからはじき出される（取り除かれる）ことはありません。

source: The first line calls updateSaveButtonState() to check if the text field has text in it, which enables the Save button if it does.
ja: 最初の行は、updateSaveButtonState()を呼び出して、テキスト欄がそれの中にテキストを持つかどうか調べます、それがそうならばそれはSaveボタンを利用可能にします。

source: The first line of code disables the button’s automatically generated constraints.
ja: コードの最初の行は、ボタンの持つ自動生成の制約を作動しないようにします。

source: The first line updates the meals array.
ja: 最初の行はmeals配列を更新します。

source: The first of these is numberOfSections(In:), which tells the table view how many sections to display.
ja: これらの最初のものは、numberOfSections(In:)です、それはテーブルビューにどれだけ多くのセクションを表示するか伝えます。

source: The first of these, imagePickerControllerDidCancel(_:), gets called when a user taps the image picker’s Cancel button.
ja: これらの最初のもの、imagePickerControllerDidCancel(_:)が呼ばれるのは、ユーザがイメージピッカーの「キャンセル」ボタンをタップした時です。

source: The focused state is used by focus-based interfaces, like Apple TV.
ja: フォーカス状態は、フォーカス基盤のインターフェイスによって使用されます、Apple TVのように。

source: The graphical environment for building a user interface (UI) in Xcode.
ja: ユーザインターフェイス (UI)をXcodeで構築するためのグラフィカル環境。

source: The guard statement both unwraps the optional and downcasts the enclosed type to a String, before assigning it to the name constant.
ja: guard文は、オプショナルを、それをname定数に割り当てる前に、アンラップして封入された型をStringへダウンキャストします。

source: The guard statements check that all the downcasts work as expected, and all optionals contain non-nil values.
ja: guard文は、すべてのダウンキャストが正確に働くこと、そしてすべてのオプショナルが非nil値を含むことを点検します。

source: The icon to the right shows whether the test method succeeded or failed.
ja: 右のアイコンは、テストメソッドが成功したか失敗したかを示します。

source: The identifier tells dequeueReusableCell(withIdentifier:for:) which type of cell it should create or reuse.
ja: 識別子は、dequeueReusableCell(withIdentifier:for:)に、それが作成または再利用するセルはどの型かを伝えます。

source: The implementation should be empty at this point.
ja: 実装はこの時点では空のはずです。

source: The implementation should look like this:
ja: 実装はこのように見えるはずです：

source: The individual rows in a table view are managed by table view cells (UITableViewCell), which are responsible for drawing their contents.
ja: テーブルビュー内の個々の行は、テーブルビューセル（UITableViewCell）によって管理されます、それはその内容を描画する責任を持ちます。

source: The initializers should look like this:
ja: それらイニシャライザはこのように見えるはずです：

source: The initializer’s signature should now look like this:
ja: イニシャライザのシグネチャは、今ではこのように見えるはずです：

source: The last data source method, tableView(_:cellForRowAt:), configures and provides a cell to display for a given row.
ja: 最後のデータソースメソッド、tableView(_:cellForRowAt:)は、指定された列に対して表示するためにセルを構成して提供します。

source: The last thing you need to do to set up the rating control is to give the ViewController class a reference to it.
ja: 格付けコントロールの設定としてあなたが最後にしなければならないことは、ViewControllerクラスにそれへの参照を持たせることです。

source: The layer of visual elements that lets a user interact with a piece of software.
ja: 視覚的要素の階層（レイヤ）、それはユーザにソフトウェアのある部分と相互作用させます。

source: The lessons are each accompanied by an Xcode project file that shows an example of how your code and interface should look at the end of the lesson.
ja: これらレッスンは、それぞれひとつのXcodeプロジェクトファイルを伴います、それはあなたのコードとインターフェイスがそのレッスンの終わりでどのように見えるはずかを例示します。

source: The lessons build on each other, walking you through a step-by-step process of creating a simple, real-world iOS app.
ja: レッスンは互いを足場として、あなたをある単純な、現実のiOSアプリを作成する段階的な過程を歩ませます。

source: The lessons were written using Xcode 8.1, iOS SDK 10, and Swift 3.
ja: このレッスンはXcode8.1、iOS SDK 10、そしてSwift 3を使って書かれました。

source: The line after it, which is part of the template implementation, deletes the corresponding row from the table view.
ja: それの後の行、ひな形実装の一部であるものは、対応する行をテーブルビューから消去します。

source: The lines starting with button.heightAnchor and button.widthAnchor create the constraints that define the button’s height and width.
ja: button.heightAnchorとbutton.widthAnchorで始まる行は制約を作成するもので、ボタンの持つ高さと幅を定義します。

source: The list of items you added in the viewDidLoad() method should show up as cells in your table view.
ja: あなたがviewDidLoad()メソッドに加えた項目のリストが、セルとしてあなたのテーブルビューの中に姿を見せるはずです。

source: The main types of tests you can write are functional tests (to check that everything is producing the values you expect) and performance tests (to check that your code is performing as fast as you expect it to).
ja: あなたが書くことができるテストの主な種類は、機能的なテスト（あらゆるものがあなたが予期する値を生み出していることを検査するため）と性能テスト（あなたのコードがあなたがそれがそうなると予想するほど速く実行していることを検査するため）です。

source: The meal scene user interface should look something like this:
ja: 食事シーンユーザインターフェイスは、このようなものに見えるはずです：

source: The message tells the delegate about an event that the delegating object is about to handle or has just handled.
ja: このメッセージは、委任しているオブジェクトがまさに取り扱おうとしているまたはちょうど取り扱い終えたイベントについて委任先に教えます。

source: The method asks ViewController to present the view controller defined by imagePickerController.
ja: このメソッドがViewControllerに尋ねることはimagePickerControllerによって定義されるビューコントローラが存在するかです。

source: The method should appear as shown below:
ja: メソッドは下に示すように現れるはずです：

source: The minimum size needed to display all the content in a view without clipping or distorting that content.
ja: あるビューの中の全ての内容を、その内容を切り詰めたり崩したりすることなく表示するために必要な最小サイズ。

source: The name of that delegate protocol is UIImagePickerControllerDelegate, and the object that you’ll define as the image picker controller’s delegate is ViewController.
ja: 委任先プロトコルの名前はUIImagePickerControllerDelegateです、そしてあなたがイメージピッカーコントローラの委任先として定義するオブジェクトはViewControllerです。

source: The natural place to track this is in a custom view controller subclass that’s connected to the meal list scene.
ja: この足跡を残しておく自然な場所は、カスタムビューコントローラのサブクラスの中です、それは食事リストシーンに接続されます。

source: The navigation bar extends its background to the top of the status bar, so the status bar doesn’t overlap with your content anymore.
ja: ナビゲーションバーは、それの背景をステータスバーの上部まで拡げます、それでステータスバーはあなたのコンテンツと今ではもう重なりません。

source: The navigation bar should now have a title and display an Add button (+).
ja: ナビゲーションバーは、現在タイトルを持ち、追加ボタン（+）を表示します。

source: The new init?(coder:) initializer should look like this:
ja: 新しいinit?(coder:)イニシャライザはこのように見えるはずです：

source: The next data source method, tableView(_:numberOfRowsInSection:), tells the table view how many rows to display in a given section.
ja: 次のデータソースメソッド、tableView(_:numberOfRowsInSection:)は、テーブルビューがどのくらい多くの行を指定されたセクションに表示するかを教えます。

source: The next step in creating the FoodTracker app’s functionality is implementing the ability for a user to add a new meal.
ja: FoodTrackerアプリの機能性の作成における次の段階は、ユーザが新しい食事を追加する能力の実装です。

source: The next step in creating the unwind segue is to add an action method to the destination view controller (the view controller that the segue is going to).
ja: 巻き戻しセグエを作成する次の段階は、アクションメソッドをデスティネーション（行先）ビューコントローラ（セグエが向かっている先のビューコントローラ）に加えることです。

source: The next step in finishing the meal scene is adding a way to display a photo of a particular meal.
ja: 食事シーンを仕上げる次の段階は、ある食事の写真を表示する方法を加えることです。

source: The object that receives the action message in the target-action pattern.
ja: ターゲットアクションパターンにおいてアクションメッセージを受け取るオブジェクト。

source: The operator returns an optional value, which will be nil if the downcast wasn’t possible.
ja: この演算子はオプショナルの値を返します、それはダウンキャストが可能でなかったならばnilになります。

source: The other affects all views in the current view controller.
ja: もう１つは、現在のビューコントローラの中の全てのビューに影響します。

source: The period during which a program is executing.
ja: あるプログラムが実行されている始めから終わりまでの期間。

source: The preview shows the image view and the label.
ja: プレビューは、イメージビューとラベルを示します。

source: The process of attempting to assign an optional value to a constant in a conditional statement to see if the optional contains an underlying value.
ja: あるオプショナル値を、そのオプショナルがその裏に値を含んでいるか知るために、条件文の中の定数に割り当てようと試みる処理。

source: The process of inserting string representations of constants, variables, literals, and expressions into longer strings.
ja: 定数、変数、リテラル、そして式の文字列表現をより長い文字列に挿入する処理。

source: The project is still just a relatively simple, single scene, but you will continue to add features and increase its complexity over the remaining lessons.
ja: このプロジェクトは、まだ比較的単純なものでしかありません、しかしあなたは機能の追加を続けていってそれの複雑さを残りのレッスンを乗り越えて増やしていくことになります。

source: The protocol that defines a text field’s delegate is called UITextFieldDelegate.
ja: テキスト欄の委任先を定義するプロトコルは、UITextFieldDelegateと呼ばれます。

source: The push-style navigation you get by using the show segue is working just as it’s supposed to—but it’s not quite what you want when adding items.
ja: あなたが表示セグエを使って得たこのプッシュ形式ナビゲーションは、まさにそれがしなければならない通りに機能しています—しかしそれは完全には項目を加える時にあなたが望むことではありません。

source: The question mark (?) means that this is a failable initializer that might return nil.
ja: 疑問符（?）は、それが失敗できるイニシャライザであるのを意味し、それはnilを返すかもしれません。

source: The rating control appears as a row of stars.
ja: 格付けコントロールは、星の列として現れます。

source: The rating control isn’t rendered in the preview, but otherwise the table view cell looks as expected.
ja: 格付けコントロールはプレビューにおいて描出されません、しかし他の点ではテーブルビューセルは予想された通りに見えます。

source: The red square is the button you added in the initializer.
ja: この赤い四角は、あなたがイニシャライザに加えたボタンです。

source: The representation or structure of data within an app.
ja: あるアプリ内のデータの描写または構造。

source: The rest of the declaration declares a method by the name of setDefaultLabelText(_:).
ja: 宣言の残りは、setDefaultLabelText(_:)の名前でメソッドを宣言します。

source: The rest of the declaration defines an implicitly unwrapped optional variable of type UITextField named nameTextField.
ja: この宣言の残りは、暗黙的にアンラップされるオプショナルで型UITextFieldのnameTextFieldと名付けられる変数を定義します。

source: The rest of the elements in the stack view reposition themselves appropriately.
ja: スタックビューの中の残りの要素は、それら自身で適切に再び位置決めをします。

source: The return value of decodeObjectForKey(_:) is an Any? optional.
ja: decodeObjectForKey(_:)の戻り値は、Any?オプショナルです。

source: The root of the property list is a dictionary that holds a set of predefined keys and their values.
ja: プロパティリストのルートは１つのディクショナリで、ひとそろいのあらかじめ設定されたキーとそれらの値を保持します。

source: The root view controller is never popped off (removed from) the stack.
ja: ルートビューコントローラは、決してスタックからポップ（削除）されません。

source: The save location defaults to your project directory.
ja: 保存場所は、初期状態であなたのプロジェクトディレクトリです。

source: The scene from your storyboard appears on the device’s screen, and the user interface’s behavior is defined in ViewController.swift.
ja: あなたのストーリーボードからのシーンがデバイスの画面上に現れます、そしてユーザインターフェイスの挙動はViewController.swiftにおいて定義されます。

source: The scene is starting to look like a real app.
ja: シーンは、本物のアプリのように始まっています。

source: The second UIImagePickerControllerDelegate method that you need to implement, imagePickerController(_:didFinishPickingMediaWithInfo:), gets called when a user selects a photo.
ja: あなたが実装する必要のある２番目のUIImagePickerControllerDelegateメソッド、imagePickerController(_:didFinishPickingMediaWithInfo:)が呼ばれるのは、ユーザがある写真を選択した時です。

source: The second line of code in the method should now look like this:
ja: このメソッドのコードの２行目は今ではこのように見えるはずです：

source: The second line reloads the appropriate row in the table view.
ja: ２行目は、テーブルビューの中の適切な行を再読み込みします。

source: The second line sets the title of the scene to that text.
ja: ２行目は、このシーンのタイトルを、そのテキストに設定します。

source: The second method that you need to implement, textFieldDidEndEditing(_:), is called after the text field resigns its first-responder status.
ja: あなたが実装する必要がある２つ目のメソッド、textFieldDidEndEditing(_:)は、テキスト欄がそれのファーストレスポンダ状態を破棄した後に呼ばれます。

source: The segue pushes the view controller for the meal detail scene onto the navigation stack that contains the meal list scene.
ja: セグエは、食事詳細シーンのためのビューコントローラを、食事リストシーンを含むナビゲータースタック上へとプッシュします（上重ねします）。

source: The sender is the Set Default Label Text button.
ja: センダー（送り手）は、Set Default Label Textボタンです。

source: The sender is usually a control—such as a button, slider, or switch—that can trigger an event in response to user interaction such as a tap, drag, or value change.
ja: センダーは大抵はあるコントロールです — 例えばボタン、スライダ、またはスイッチなど — それはあるイベントをユーザとのやりとり、例えばタップ、ドラッグ、または値の変更などに対する応答において引き起こすことができます。

source: The set of view controllers managed by a particular navigation controller.
ja: ひとまとめにされたビューコントローラで、ある特定のナビゲーションコントローラによって管理されます。

source: The set of Apple frameworks and technologies used to develop iOS apps.
ja: iOSアプリを開発するために使われるAppleフレームワークとテクノロジーのひとそろい。

source: The set of view controllers managed by a particular navigation controller is called its navigation stack.
ja: ある特定のナビゲーションコントローラによって管理されるある一組のビューコントローラは、それのナビゲーションスタックと呼ばれます。

source: The simulator can model a number of different types of hardware—All the screen sizes and resolutions for both iPad and iPhone—so you can simulate your app on every device you’re developing for.
ja: シミュレータは、多くの異なる型のハードウェアをモデル化することができます — iPadとiPhone両方の画面サイズと解像度のすべて — それであなたはあなたのアプリをあなたが開発しているあらゆるデバイス上でシミュレートできます。

source: The simulator gives you an idea of how your app would look and behave if it were running on a device.
ja: シミュレータは、あなたのアプリがどう見えるだろうかそしてそれがデバイス上で動作していたならばどう振る舞うかの見解をあなたに与えます。

source: The simulator opens in the iPhone mode you specified and then launches your app.
ja: シミュレータは、まさしくあなたが指定したようにiPhoneモードで開きます、それからあなたのアプリを起動します。

source: The simulator opens the Photos app and shows the images you added.
ja: シミュレータは、Photosを開いてあなたが加えた画像を表示します。

source: The stack view rearranges your user interface elements to fill the gap that the button left.
ja: スタックビューは、あなたのユーザインターフェイス要素を配列し直して下と左の隙間を埋めます。

source: The stack view uses Auto Layout under the hood to calculate the size and position of all the views that it manages.
ja: スタックビューは、「自動レイアウト」をその覆いの下で使用して、それが管理するすべてのビューの大きさと位置を計算します。

source: The stack view will automatically define the button’s position, and you will add constraints to define the button’s size.
ja: スタックビューは、自動的にボタンの位置を定義します、そしてあなたは制約を加えることでボタンの大きさを定義します。

source: The subclass must implement (or automatically inherit) all of the required initializers.
ja: サブクラスは、必須イニシャライザの全てを実装（または自動的に継承）しなければなりません。

source: The system also creates an instance of your AppDelegate class, and assigns it to the application object.
ja: システムはまた、あなたのAppDelegateクラスのインスタンスを作成します、そしてそれをアプリケーションオブジェクトへ割り当てます。

source: The system automatically runs this test case when the unit tests are run.
ja: システムは、ユニットテストが実行される時に自動的にこのテスト項目を実行します。

source: The system must ask the user for permission before accessing their photo library.
ja: システムは、ユーザに彼らのフォトライブラリにアクセスする前に許可を求めなければなりません。

source: The system sends the message by calling the action method on the target and passing in the sender object.
ja: システムはメッセージを、アクションメソッドをターゲット上で呼び出してセンダーオブジェクトに渡すことによって送ります。

source: The system uses this image (possibly with an added effect) whenever a state or combination of states doesn’t have an image of their own.
ja: システムは、ある状態または幾つかの状態の組み合わせがそれら独自の画像を持たないときはいつでもこの画像を（ことによると追加の効果と共に）使います。

source: The table can then create instances of this cell.
ja: テーブルは、それからこのセルのインスタンスを作成できます。

source: The table view cells now look taller.
ja: テーブルビューセルは今ではより長く見えます。

source: The table view controller is set as the initial view controller in your storyboard, making the meal list the first scene that loads on app launch.
ja: テーブルビューコントローラは、あなたのストーリーボードの最初のビューコントローラとして設定されて、食事リストはアプリ起動でロードされる最初のシーンにされます。

source: The table view controller is the navigation controller’s root view controller.
ja: テーブルビューコントローラは、ナビゲーションコントローラの持つルートビューコントローラです。

source: The table view controller template includes a number of method stubs and commented out methods.
ja: テーブルビューコントローラ雛形は、多くのメソッドスタブとコメントアウトされたメソッドを含みます。

source: The table view is nested under Table View Controller Scene > Table View Controller.
ja: テーブルビューは、Table View Controller Scene > Table View Controllerの下に入れ子にされます。

source: The table view object is just a view representing the table itself.
ja: テーブルビューオブジェクトは、単にテーブルそれ自体を表しているビューです。

source: The target is ViewController (where the action method is defined).
ja: ターゲット（目標）は、ViewControllerです（ここでアクションメソッドが定義されます）。

source: The target is self, which refers to the current instance of the enclosing class.
ja: ターゲットはselfです、それは周りを囲んでいるクラスの現在のインスタンスを参照します。

source: The task now is to pass the Meal object to MealTableViewController when a user taps the Save button and discard it when a user taps the Cancel button, switching from displaying the meal detail scene to displaying the meal list in either case.
ja: 次の作業はMealオブジェクトを、ユーザがSaveボタンをタップする時にはMealTableViewControllerに渡し、ユーザがCancelボタンをタップする時には廃棄して、両方の場合で食事詳細シーンの表示から食事リストの表示へと切り替えることです。

source: The template also provides comments for each of the stub methods.
ja: このテンプレートはまた、スタブメソッドそれぞれに対するコメントを提供します。

source: The template implementation looks like this:
ja: ひな形実装はこのように見えます：

source: The template implementation of this method includes a comment.
ja: このメソッドのひな形実装はコメントを１つ含みます。

source: The template implementation of this method includes comments that were inserted by Xcode when it created MealTableViewController.swift.
ja: このメソッドの見本実装は、コメントを含みます、それは、XcodeによってそれがMealTableViewController.swiftを作成した時に挿入されたものです。

source: The text field, label, and button are subviews of the content view.
ja: テキスト欄、ラベル、そしてボタンは、コンテンツビューのサブビューです。

source: The text field, label, and button keep the same size and position relative to the screen’s upper left corner.
ja: テキスト欄、ラベル、そしてボタンは、同じ大きさと位置を画面の上左隅に関して保ちます。

source: The top layout guide is positioned at the bottom of the status bar, if the status bar is visible.
ja: 上部レイアウトガイドは、ステータスバーの一番下に置かれます、ステータスバーが見えているならば。

source: The type of imagePickerController.sourceType is known to be UIImagePickerControllerSourceType, which is an enumeration.
ja: imagePickerController.sourceTypeの型はimagePickerController.sourceTypeとして知られます、それは列挙です。

source: The type of dismissal depends on how the scene was presented.
ja: 退去の種類は、どのようにそのシーンが提示されたかに依存します。

source: The underscore (_) represents a wildcard, which you can use when you don’t need to know which iteration of the loop is currently executing.
ja: アンダースコア（_）は、ワイルドカード（万能札）を表します、それはループのどの繰り返しが現在実行されているかをあなたが知る必要がない時に使うことができるものです。

source: The unit tests themselves are defined in a class, FoodTrackerTests, which inherits from XCTestCase.
ja: ユニットテストそれ自身は、あるクラス、FoodTrackerTestsにおいて定義されます、それはXCTestCaseから継承します。

source: The user can then makes changes to the meal.
ja: ユーザは、それから変更をその食事に行うことができます。

source: The user must interact with the presented controller, and dismiss it before returning to the app’s main flow.
ja: ユーザは、提示されたコントローラと相互作用して、アプリのメインフローに戻る前にそれを退去させなければなりません。

source: The user needs to be able to select a rating by tapping a star, so you’ll replace the debugging implementation with a real implementation of the ratingButtonTapped(_:) method.
ja: ユーザが必要とするのは、格付けの選択がある星のタップによってできることです、それであなたはデバック実装を実際の実装のratingButtonTapped(_:)メソッドで置き換えます。

source: The user performs actions in the interface that trigger events in the app.
ja: ユーザは、インターフェイスにおいていろいろな行動を行い、それはアプリにおいていろいろなイベントを引き起こします（ユーザアクション・イベント）。

source: The view controller’s outlets are guaranteed to have valid values by the time this method is called.
ja: ビューコントローラの持つアウトレットは、有効な値を持つことをこのメソッドが呼び出される時までに保障されます。

source: The view may be obscured by other views or hidden.
ja: ビューは、他のビューまたは隠されることによって見えなくさせられるかもしれません。

source: Then it reads the accessibility value.
ja: それからそれはアクセシビリティ値を読み上げます。

source: Then, double-click on the Value section and enter Allows you to add photos to your meals.
ja: それから、ValueセクションをダブルクリックしてAllows you to add photos to your mealsを入力してください。

source: Then, you can click the Cancel button to dismiss the picker, or open Camera Roll and click an image to select it and set it as the image in the image view.
ja: そのとき、あなたはCancelボタンをクリックしてピッカーを片付けることができます、またはCamera Rollを開いてひとつの画像をクリックしてそれを選択し、それをイメージビューの中の画像として設定することができます。

source: Then, you’ll define an action method to change the image when a tap occurs.
ja: そうすれば、あなたはアクションメソッドを定義することで、タップが起こったとき画像を変更します。

source: There are many ways to implement this, but this lesson focuses on a straightforward approach, building a custom control by combining existing views and controls.
ja: 多くの方法がこれを実装するためにはあります、しかしこのレッスンは直接的な取り組みに焦点を当て、カスタムコントロールを既存のビューとコントロールを組み合わせることで構築します。

source: There is no need for a guard statement here, because the photo property is itself an optional.
ja: guard文はここでは必要ありません、なぜならphotoプロパティはそれ自身オプショナルであるからです。

source: There will only ever be one copy of these properties, no matter how many instances of the Meal class you create.
ja: 常にこれらプロパティの１つのコピーだけが存在します、あなたが作成するMealクラスのインスタンスがどれだけあるかは問題ではありません。

source: Therefore, it’s safe to force unwrap the optional.
ja: したがって、それは安全にオプショナルを強制的にアンラップします。

source: Therefore, the code now checks to make sure the user was adding a new meal before calling dismiss(animated:completion:).
ja: したがって、コードは今ではユーザが新しい食事を加えていたことをdismiss(animated:completion:)を呼び出す前に確かめるため点検します。

source: Therefore, there’s no need to create a more-complex solution to update the existing buttons in place.
ja: それゆえに、既存のボタンをその場で更新するもっと複雑な解決策を作成する必要はありません。

source: Therefore, you need to add a little space between the stack view and the layout guide.
ja: したがって、あなたは小さな空白をスタックビューとレイアウトガイドの間に加える必要があります。

source: Therefore, you’ll use the same interface to perform both tasks.
ja: それゆえに、あなたは同じインターフェイスを両方の作業を実行するのに使います。
